import "./Section2.scss"
import { Photo } from "../../../../Images.js"
import { use, useState } from "react"
import { Link } from "react-router-dom"

const years = [
    {title: "За все время", from: 0, to: 9999},
    {title: "2010-2020", from: 2010, to: 2020},
    {title: "2000-2010", from: 2000, to: 2010},
    {title: "1990-2000", from: 1990, to: 2000},
]
const places = [
    {year: "2008-2013", from: 2008, to: 2013, img: Photo.OpePlace1, title: "Renaissance Moscow Towers", text: "Актуализация инженерно-геологических изысканий на уч. № 17-18 ММДЦ «Москва-Сити». Бурение инженерно-геологических скважин до глубины 100 м, прессиометрические испытания, лабораторные исследования, гидрогеологическое моделирование Результаты работ прошли государственную экспертизу, ведется строительство."},
    {year: "2007", from: 2007, to: 2007, img: Photo.OpePlace2, title: "Башня «Россия»", text: "Башня «Россия» на уч. №17-18 ММДЦ «Москва-Сити». Бурение более 60 инженерно-геологических скважин глубиной до 100 м, геофизические исследования, межскважинное сейсмическое прозвучивание, прессиометрические испытания, опытно-фильтрационные работы, лабораторные исследования, гидрогеологическое и геомеханическое моделирование, и другие исследования для реализации этого уникального проекта"},
    {year: "2007", from: 2007, to: 2007, img: Photo.OpePlace3, title: "Башни «Око»", text: "Башня «Россия» на уч. №17-18 ММДЦ «Москва-Сити». Бурение более 60 инженерно-геологических скважин глубиной до 100 м, геофизические исследования, межскважинное сейсмическое прозвучивание, прессиометрические испытания, опытно-фильтрационные работы, лабораторные исследования, гидрогеологическое и геомеханическое моделирование, и другие исследования для реализации этого уникального проекта"},
    {year: "2006", from: 2006, to: 2006, img: Photo.OpePlace4, title: "Башня «Эволюция»", text: "Башня «Evolution» на уч. 2-3 ММДЦ «Москва-Сити» Бурение инженерно-геологических скважин до глубины 40-80 м, прессиометрические испытания грунтов, опытно-фильтрационные работы, лабораторные исследования, гидрогеологическое моделирование, оценка геологических рисков. Строительство завершено в 2014 году"},
    {year: "2006", from: 2006, to: 2006, img: Photo.OpePlace5, title: "Выставочно-деловой комплекс", text: "Анализ геологических условий территории ММДЦ «Москва-Сити» в предпроектных предложениях. Анализ материалов изысканий на разных участках ММДЦ «Москва-Сити», гидрогеологическое и геомеханическое моделирование"},
    {year: "2005", from: 2005, to: 2005, img: Photo.OpePlace6, title: "Анализ геологических условий территории", text: "Анализ геологических условий территории ММДЦ «Москва-Сити» в предпроектных предложениях. Анализ материалов изысканий на разных участках ММДЦ «Москва-Сити», гидрогеологическое и геомеханическое моделирование"},
    {year: "2004", from: 2004, to: 2004, img: Photo.OpePlace7, title: "Комплекс «Северная Башня»", text: "Комплекс «Северная башня» на уч. №19 ММДЦ «Москва-Сити». Дополнительные исследования для уточнения закарстованности массива» Бурение инженерно-геологических скважин глубиной до 20 м, лабораторные исследования. Сооружение построено в 2005 году"},
    {year: "2003-2004", from: 2003, to: 2004, img: Photo.OpePlace8, title: "Комплекс «Федерация»", text: "Комплекс «Федерация» на 13-м участке ММДЦ «Москва-Сити». Бурение инженерно-геологических скважин до глубины 50-100 м, проведение геофизического каротажа, опытно-фильтрационные работы, лабораторные исследования, электромагнитное обследование участка. Проект находится в завершающей стадии строительства"},
    {year: "2001", from: 2001, to: 2001, img: Photo.OpePlace9, title: "Башня «Империя»", text: "Высотное здание на уч. 4 ММДЦ «Москва-Сити». Бурение инженерно-геологических скважин, лабораторные исследования, опытно-фильтрационные работы. Проект реализован в 2011 г. в измененном виде"},
    {year: "1996-2015", from: 1996, to: 2015, img: Photo.OpePlace10, title: "Гидрогеологический мониторинг территории", text: "Высотное здание на уч. 4 ММДЦ «Москва-Сити». Бурение инженерно-геологических скважин, лабораторные исследования, опытно-фильтрационные работы. Проект реализован в 2011 г. в измененном виде"},
]

export default function Section2(){

    const [isActive, setIsActive] = useState(0)

    const filtered = places.filter((meow) => {
        const isCorrect = years[isActive].from <= meow.to && meow.from <= years[isActive].to
        return isCorrect
    })
    
    return(
        <>
            <section className="page2_ope_section2">
                <div className="page2_ope_section2_inside">
                    <div className="page2_ope_section2_inside_years">
                        {years.map((meow, index) => (
                            <button
                                key={index}
                                className={isActive === index ? "current" : ""}
                                onClick={() => setIsActive(index)}
                            >
                                {meow.title}
                            </button>
                        ))}
                    </div>
                    <div className="page2_ope_section2_inside_places">
                        {filtered.map((meow, index) => (
                            <article key={index}>
                                <div className="article_top">
                                    <h2>{meow.title}</h2>
                                    <p>{meow.text}</p>
                                </div>
                                <div className="article_bot">
                                    <p>{meow.year}</p>
                                    <img src={meow.img} alt="" />
                                </div>
                            </article>
                        ))}
                    </div>
                </div>
            </section>
        </>
    )
}